000001*MI PRIMER PROGRAMA EN COBOL
000002 IDENTIFICATION DIVISION.
000003 PROGRAM-ID. HolaMundo.

       ENVIRONMENT DIVISION.

       DATA DIVISION.

       PROCEDURE DIVISION.
           DISPLAY "HOLA MUNDO".
           STOP "PAUSA".

       STOP RUN.
